Revit 2026 API

# CircuitNumberingOption Enumeration

---

An enumerated type listing all the circuit numbering options.

**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public enum CircuitNumberingOption
```
```vb
Public Enumeration CircuitNumberingOption
```
```cpp
public enum class CircuitNumberingOption
```
```fsharp
type CircuitNumberingOption
```

| Member name | Value | Description |
| --- | --- | --- |
| Continuous | 1 | Circuit numbering type is continuous from its parent panel. |
| Default | 0 | Circuit numbering type is starting from one. |

#### Reference

Autodesk.Revit.DB.Electrical Namespace